{
  "Đảo Trường Sa Lớn nằm ở đâu?": "Đảo Trường Sa Lớn thuộc quần đảo Trường Sa của Việt Nam, nằm ở Biển Đông, cách đất liền khoảng 500 km.",
  "Trên đảo có những công trình gì?": "Trên đảo có nhà ở của cư dân, trạm khí tượng, đèn hải đăng, trạm điện mặt trời, bệnh xá, trường học và nhiều công trình phục vụ đời sống.",
  "Có bao nhiêu người đang sinh sống trên đảo?": "Hiện nay, trên đảo Trường Sa Lớn có khoảng 200 cư dân bao gồm ngư dân, bộ đội, nhân viên y tế và giáo viên.",
  "Thời tiết trên đảo như thế nào?": "Khí hậu trên đảo Trường Sa Lớn là nhiệt đới gió mùa, thường có nắng nhiều, gió mạnh, và đôi khi có bão vào mùa mưa.",
  "Mô hình được thiết kế dựa trên tỉ lệ nào?": "Mô hình được thiết kế theo tỉ lệ thu nhỏ dựa trên bản đồ thực tế, đảm bảo tái hiện đúng vị trí các công trình và cảnh quan.",
  "Những công trình nào được tái hiện trên mô hình?": "Mô hình bao gồm nhà ở, trạm hải đăng, cột mốc chủ quyền, bến tàu, hệ thống điện mặt trời và khu du lịch trải nghiệm.",
  "Mô hình có kích thước bao nhiêu?": "Mô hình đảo Trường Sa lớn có kích thước khoảng 65 nhân 30 xăng ti mét, đủ lớn để hiển thị đầy đủ các chi tiết.",
  "Mô hình sử dụng những vật liệu gì?": "Các vật liệu chính gồm bìa, giấy màu, nhựa sinh học, pin năng lượng mặt trời và hệ thống đèn LED.",
  "Tại sao mô hình sử dụng vật liệu thân thiện với môi trường?": "Để giảm thiểu rác thải, bảo vệ môi trường và tăng tính bền vững cho sản phẩm.",
  "Mô hình mất bao lâu để hoàn thành?": "Mô hình được thực hiện trong 1 tháng, bao gồm lên ý tưởng, thiết kế, thi công và hoàn thiện.",
  "Mô hình này sử dụng công nghệ gì?": "Mô hình kết hợp công nghệ năng lượng mặt trời, hệ thống AI nhận diện giọng nói và đèn LED thông minh.",
  "Hệ thống năng lượng mặt trời hoạt động như thế nào?": "Tấm pin mặt trời hấp thụ ánh sáng và chuyển hóa thành điện năng để cấp nguồn cho hệ thống đèn LED và các thiết bị khác.",
  "Tại sao lại sử dụng đèn LED trên mô hình?": "Đèn LED giúp mô phỏng ánh sáng trên đảo, tạo hiệu ứng chân thực và tiết kiệm năng lượng.",
  "AI nhận diện giọng nói trong mô hình hoạt động ra sao?": "Hệ thống AI có thể nhận diện câu hỏi từ người dùng và đưa ra câu trả lời liên quan đến mô hình.",
  "Ứng dụng AI có thể trả lời những câu hỏi gì?": "AI có thể trả lời về thiết kế mô hình, hệ sinh thái biển, năng lượng mặt trời và ý nghĩa của đảo Trường Sa.",
  "Mô hình này có ý nghĩa gì?": "Mô hình giúp nâng cao nhận thức về chủ quyền biển đảo, giáo dục về công nghệ và bảo vệ môi trường.",
  "Sản phẩm này có thể ứng dụng vào thực tế không?": "Có, mô hình có thể được sử dụng trong giảng dạy STEM, trưng bày tại các sự kiện giáo dục và nghiên cứu về năng lượng tái tạo.",
  "Mô hình có thể mở rộng hoặc nâng cấp không?": "Có, có thể mở rộng bằng cách bổ sung thêm các cảm biến thời tiết, hệ thống điều khiển từ xa và mô phỏng các hoạt động trên đảo.",
  "Làm thế nào để duy trì hoạt động của mô hình?": "Cần kiểm tra hệ thống điện mặt trời, bảo trì pin sạc và cập nhật phần mềm AI để tối ưu phản hồi.",
  "Hệ thống điện mặt trời trên đảo hoạt động thế nào?": "Hệ thống điện mặt trời trên đảo gồm các tấm pin hấp thụ ánh sáng mặt trời, chuyển hóa thành điện năng để cung cấp cho đèn, quạt và các thiết bị khác.",
  "Trường Sa Lớn là gì?": "Trường Sa Lớn là một đảo san hô thuộc quần đảo Trường Sa của Việt Nam, nằm trong vùng biển Đông Nam Á.",
  "Diện tích của đảo Trường Sa Lớn là bao nhiêu?": "Đảo Trường Sa Lớn có diện tích tự nhiên khoảng 0,365 km².",
  "Huyện Trường Sa thuộc tỉnh nào quản lý?": "Huyện Trường Sa thuộc tỉnh Khánh Hòa quản lý về mặt hành chính.",
  "Trường Sa Lớn nằm ở vị trí tọa độ nào?": "Đảo Trường Sa Lớn nằm ở vị trí tọa độ 8°38′41″B 111°55′12″Đ.",
  "Chiều dài và chiều rộng chính xác của đảo là bao nhiêu?": "Đảo có chiều dài khoảng 1300 mét và chiều rộng khoảng 500 mét.",
  "Đảo Trường Sa Lớn thuộc địa phận thị trấn nào?": "Đảo thuộc địa phận thị trấn Trường Sa, huyện Trường Sa, tỉnh Khánh Hòa.",
  "Có quốc gia nào tranh chấp đảo Trường Sa Lớn không?": "Đảo Trường Sa Lớn hiện đang có tranh chấp từ các nước như Trung Quốc và Đài Loan, nhưng Việt Nam đang thực hiện quản lý.",
  "Trường Sa Lớn có tên gọi khác không?": "Đảo Trường Sa còn được gọi là Trường Sa Lớn để phân biệt với tên gọi chung của quần đảo Trường Sa.",
  "Đảo Trường Sa có vai trò địa chiến lược như thế nào?": "Đảo Trường Sa Lớn có vai trò chiến lược quan trọng về an ninh, kinh tế và chính trị tại khu vực Biển Đông, nằm trên tuyến hàng hải quốc tế quan trọng.",
  "Đảo Trường Sa thuộc quản lý hành chính của đơn vị nào?": "Đảo Trường Sa thuộc quản lý hành chính của thị trấn Trường Sa, huyện Trường Sa, tỉnh Khánh Hòa, Việt Nam.",
  "Có những thực thể nào đang tranh chấp chủ quyền đối với đảo Trường Sa?": "Đảo Trường Sa hiện là đối tượng tranh chấp giữa Việt Nam, Trung Quốc và Đài Loan, tuy nhiên Việt Nam đang thực hiện quyền quản lý.",
  "Cách gọi chính thức của đảo này là gì?": "Cách gọi chính thức là đảo Trường Sa, nhưng thường được gọi là Trường Sa Lớn để phân biệt với tên gọi chung của cả quần đảo.",
  "Đảo Trường Sa có những đặc điểm địa lý nào nổi bật?": "Đảo Trường Sa là một đảo san hô tiêu biểu của Biển Đông, có diện tích tương đối lớn so với các đảo khác trong quần đảo, với bờ biển và bãi cát trắng bao quanh.",
  "Đảo Trường Sa Lớn có hệ sinh thái như thế nào?": "Đảo có hệ sinh thái đặc trưng của vùng biển nhiệt đới, bao gồm các rạn san hô, nhiều loài sinh vật biển và các loài thực vật chịu mặn.",
  "Từ khi nào Việt Nam thực hiện quyền quản lý đối với đảo Trường Sa Lớn?": "Việt Nam đã thực hiện quyền quản lý đối với đảo Trường Sa từ lâu đời trong lịch sử và hiện nay tiếp tục thực hiện quyền quản lý hiệu quả thông qua các hoạt động dân sự và hành chính.",
  "Thời tiết trên đảo Trường Sa Lớn có đặc điểm gì?": "Đảo Trường Sa có khí hậu nhiệt đới gió mùa, nhiệt độ cao và ổn định quanh năm, có hai mùa rõ rệt là mùa mưa và mùa khô.",
  "Người dân trên đảo Trường Sa Lớn sinh sống bằng nghề gì?": "Người dân trên đảo chủ yếu sinh sống bằng nghề đánh bắt hải sản, ngoài ra còn có các hoạt động dịch vụ phục vụ cho cộng đồng trên đảo.",
  "Đảo Trường Sa Lớn có những công trình văn hóa nào?": "Trên đảo có các công trình văn hóa như Nhà văn hóa, Bia chủ quyền, công trình tưởng niệm và các khu sinh hoạt cộng đồng.",
  "Vùng biển quanh đảo Trường Sa Lớn có giá trị kinh tế gì?": "Vùng biển quanh đảo giàu tài nguyên hải sản với nhiều loài cá, tôm, mực và các sinh vật biển có giá trị kinh tế cao.",
  "Các hoạt động bảo vệ môi trường trên đảo Trường Sa Lớn gồm những gì?": "Trên đảo có các hoạt động bảo vệ môi trường như trồng và bảo vệ cây xanh, thu gom và xử lý rác thải, bảo vệ hệ sinh thái biển và rạn san hô.",
  "Cơ sở hạ tầng trên đảo Trường Sa Lớn gồm những gì?": "Cơ sở hạ tầng trên đảo bao gồm hệ thống nhà ở, trạm y tế, trường học, hệ thống cấp điện từ năng lượng mặt trời, hệ thống thu trữ nước mưa và bến cảng.",
  "Đảo Trường Sa Lớn nổi bật với đặc điểm tự nhiên nào?": "Đảo nổi bật với các bãi cát trắng, vùng biển trong xanh và hệ sinh thái san hô phong phú xung quanh đảo.",
  "Tại sao đảo Trường Sa Lớn lại có tên như vậy?": "Đảo có tên là Trường Sa Lớn vì đây là hòn đảo có diện tích lớn nhất trong huyện đảo Trường Sa, nên được gọi là Trường Sa Lớn để phân biệt với các đảo nhỏ hơn.",
  "Mực nước biển quanh đảo Trường Sa Lớn có đặc điểm gì?": "Mực nước biển quanh đảo có biên độ thủy triều không lớn, dao động khoảng 1-2m, tạo điều kiện thuận lợi cho việc xây dựng cảng và các công trình ven bờ.",
  "Hoạt động kinh tế nào có tiềm năng phát triển trên đảo Trường Sa Lớn?": "Ngoài đánh bắt hải sản, đảo có tiềm năng phát triển du lịch sinh thái, nghiên cứu khoa học biển và phát triển các trạm năng lượng tái tạo.",
  "Việt Nam đã tiến hành những hoạt động gì để khẳng định chủ quyền tại đảo Trường Sa Lớn?": "Việt Nam đã xây dựng cơ sở hạ tầng, duy trì dân cư sinh sống, thiết lập cơ quan hành chính, trồng cây xanh và thực hiện các hoạt động kinh tế-văn hóa-xã hội trên đảo.",
  "Đảo Trường Sa Lớn có ý nghĩa gì đối với an ninh quốc phòng?": "Đảo có vị trí chiến lược quan trọng, giúp kiểm soát tuyến hàng hải quốc tế, bảo vệ chủ quyền biển đảo và là điểm tựa cho các hoạt động tuần tra, kiểm soát vùng biển.",
  "Các loài cây nào được trồng nhiều trên đảo Trường Sa Lớn?": "Các loài cây phổ biến trên đảo bao gồm dừa, phong ba, bàng vuông, phi lao và các loại cây chịu mặn khác, giúp chống xói mòn và tạo môi trường sống.",
  "Đảo Trường Sa Lớn có mối liên hệ gì với các đảo khác trong quần đảo Trường Sa?": "Đảo Trường Sa Lớn là trung tâm hành chính của huyện Trường Sa, đóng vai trò kết nối và hỗ trợ hậu cần cho các đảo nhỏ và đá ngầm khác trong quần đảo.",
  "Nguồn nước ngọt trên đảo Trường Sa Lớn được cung cấp như thế nào?": "Nguồn nước ngọt trên đảo chủ yếu được thu gom từ nước mưa vào các bể chứa lớn, kết hợp với hệ thống lọc nước biển và tiếp tế định kỳ từ đất liền.",
  "Liên lạc giữa đảo Trường Sa Lớn và đất liền được thực hiện bằng cách nào?": "Liên lạc được thực hiện qua hệ thống thông tin vệ tinh, sóng vô tuyến tầm xa và các chuyến tàu tiếp tế định kỳ từ đất liền.",
  "Đảo Trường Sa Lớn gặp phải những thách thức tự nhiên nào?": "Đảo thường xuyên đối mặt với các thách thức như bão biển, nước biển dâng, xói lở bờ biển và tác động của biến đổi khí hậu.",
  "Hệ sinh thái san hô quanh đảo Trường Sa Lớn có đặc điểm gì?": "Hệ sinh thái san hô quanh đảo rất đa dạng với nhiều loài san hô cứng và mềm, tạo thành rạn ngầm bao quanh đảo, là nơi sinh sống của nhiều loài sinh vật biển.",
  "Người dân trên đảo Trường Sa Lớn giải quyết vấn đề rác thải như thế nào?": "Rác thải được phân loại tại nguồn, phần có thể tái chế được xử lý tại chỗ, phần còn lại được thu gom và vận chuyển về đất liền trong các chuyến tàu tiếp tế.",
  "Có những nghiên cứu khoa học nào được thực hiện tại đảo Trường Sa Lớn?": "Tại đảo có các nghiên cứu về hải dương học, khí tượng thủy văn, đa dạng sinh học biển và tác động của biến đổi khí hậu đến hệ sinh thái biển đảo.",
  "Hoạt động văn hóa của cư dân trên đảo Trường Sa Lớn gồm những gì?": "Cư dân tổ chức các hoạt động văn hóa như lễ hội truyền thống, sinh hoạt cộng đồng tại nhà văn hóa, các hoạt động thể thao và kỷ niệm các ngày lễ lớn.",
  "Chương trình giáo dục trên đảo Trường Sa Lớn được tổ chức như thế nào?": "Trên đảo có trường học dành cho con em cư dân và quân nhân, với chương trình giáo dục chuẩn quốc gia, kết hợp giữa học trực tiếp và học trực tuyến với đất liền.",
  "Đảo Trường Sa Lớn nằm cách Cam Ranh bao xa?": "Đảo Trường Sa Lớn nằm cách Cam Ranh khoảng 254 hải lý (470,4 km).",
  "Đảo Trường Sa Lớn có hình dạng gì?": "Đảo Trường Sa Lớn có dạng hình tam giác vuông với cạnh huyền nằm theo hướng đông bắc-tây nam.",
  "Trên đảo Trường Sa Lớn có sân bay không?": "Có, trên đảo Trường Sa Lớn có một sân bay quân sự với đường băng dài khoảng 1200 mét.",
  "Đảo Trường Sa Lớn thuộc đơn vị hành chính nào của Việt Nam?": "Đảo Trường Sa Lớn thuộc thị trấn Trường Sa, huyện Trường Sa, tỉnh Khánh Hòa.",
  "Đảo Trường Sa Lớn có nguồn nước ngọt tự nhiên không?": "Đảo Trường Sa Lớn có nguồn nước lợ tự nhiên.",
  "Trên đảo Trường Sa Lớn có chùa không?": "Có, trên đảo Trường Sa Lớn có một ngôi chùa phục vụ nhu cầu tín ngưỡng của cư dân và quân nhân.",
  "Ai đang kiểm soát đảo Trường Sa Lớn?": "Việt Nam hiện đang kiểm soát và quản lý đảo Trường Sa Lớn.",
  "Đảo Trường Sa Lớn có vai trò gì trong quần đảo Trường Sa?": "Đảo Trường Sa Lớn là trung tâm hành chính của thị trấn Trường Sa và đóng vai trò quan trọng trong việc khẳng định chủ quyền của Việt Nam tại quần đảo Trường Sa.",
  "Trên đảo Trường Sa Lớn có trường học không?": "Có, trên đảo Trường Sa Lớn có một trường học phục vụ cho con em cư dân và quân nhân trên đảo.",
  "Khí hậu trên đảo Trường Sa Lớn như thế nào?": "Đảo Trường Sa Lớn có khí hậu nhiệt đới gió mùa, với hai mùa rõ rệt là mùa khô và mùa mưa.",
  "Trên đảo Trường Sa Lớn có hệ thống thu gom và xử lý nước ngọt như thế nào?": "Trên đảo có hệ thống thu gom nước mưa và lọc nước biển để cung cấp nước sinh hoạt cho người dân và cán bộ chiến sĩ.",
  "Hệ thống điện trên đảo Trường Sa Lớn gồm những nguồn nào?": "Hệ thống điện trên đảo sử dụng chủ yếu là năng lượng mặt trời, gió và máy phát điện chạy dầu dự phòng.",
  "Đảo Trường Sa Lớn có đảm bảo được nhu cầu sinh hoạt cho cư dân không?": "Có, trên đảo có nhà ở, trường học, trạm y tế, khu văn hóa, sân thể thao và các điều kiện thiết yếu khác phục vụ cuộc sống cư dân.",
  "Cơ sở hạ tầng trên đảo được xây dựng kiên cố ra sao?": "Các công trình trên đảo được xây dựng kiên cố bằng bê tông cốt thép, chịu được sóng gió và điều kiện thời tiết khắc nghiệt.",
  "Có hệ thống thông tin liên lạc nào trên đảo không?": "Có, trên đảo có hệ thống thông tin liên lạc vệ tinh và sóng radio giúp kết nối thường xuyên với đất liền.",
  "Đảo Trường Sa Lớn có trồng cây xanh không?": "Trên đảo được phủ xanh bằng nhiều loại cây chịu mặn như bàng vuông, phi lao, phong ba… nhằm chống xói mòn và tạo cảnh quan.",
  "Đảo Trường Sa Lớn là gì?": "Đảo Trường Sa Lớn là đảo lớn nhất thuộc quần đảo Trường Sa của Việt Nam, đóng vai trò trung tâm hành chính của thị trấn Trường Sa. Đây là một đảo san hô có vị trí chiến lược quan trọng về quân sự, chính trị và kinh tế tại Biển Đông. Đảo hiện do Việt Nam quản lý và cư dân sinh sống ổn định.",
  "Mô hình đảo Trường Sa Lớn là gì?": "Mô hình đảo Trường Sa Lớn là một bản thu nhỏ tái hiện không gian, công trình và sinh hoạt trên đảo, được thiết kế để phục vụ mục đích giáo dục STEM, nâng cao nhận thức về chủ quyền biển đảo, công nghệ xanh và bảo vệ môi trường. Mô hình sử dụng vật liệu thân thiện môi trường, tích hợp công nghệ AI, năng lượng mặt trời và hệ thống chiếu sáng thông minh.",
  "Lịch sử hình thành và phát triển của đảo Trường Sa Lớn là gì?": "Đảo Trường Sa Lớn có lịch sử hình thành từ một đảo san hô tự nhiên trong quần đảo Trường Sa. Trong lịch sử, ngư dân Việt Nam đã thường xuyên khai thác hải sản và cắm mốc chủ quyền tại khu vực này từ hàng thế kỷ trước. Từ năm 1975, sau ngày đất nước thống nhất, Việt Nam bắt đầu xây dựng cơ sở hạ tầng và thiết lập hệ thống hành chính trên đảo. Đảo được cải tạo mở rộng với các công trình dân sinh, quân sự và hành chính, trở thành trung tâm của thị trấn Trường Sa, huyện Trường Sa, tỉnh Khánh Hòa. Hiện nay, đảo được quản lý hiệu quả với sự hiện diện của cư dân, quân đội, trường học, bệnh xá và các hoạt động phát triển kinh tế, văn hóa, giáo dục và khoa học kỹ thuật.",
  "Việt Nam bắt đầu quản lý hành chính huyện đảo Trường Sa từ khi nào?": "Năm 1982, Chính phủ Việt Nam quyết định thành lập huyện đảo Trường Sa thuộc tỉnh Đồng Nai và huyện đảo Hoàng Sa thuộc tỉnh Quảng Nam - Đà Nẵng. Sau này, khi điều chỉnh địa giới hành chính, huyện Trường Sa thuộc tỉnh Khánh Hòa, còn huyện Hoàng Sa thuộc thành phố Đà Nẵng."
}